10/data/attachments/669edee4411ddc85.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>David_quite_Friend_26456_3</nif:username>
            <nif:friendToBeRequested>soap_friends_3366b451-5789-4053-9ce3-aaa5786d2676</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>